

CREATE TABLE `qanum` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `day` char(8) NOT NULL COMMENT '日期:20151104',
  `num` int(6) unsigned NOT NULL DEFAULT '1' COMMENT '问答数量(提问数+回答数)',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC COMMENT='问答数记录表';


insert  into `qanum`(`id`,`day`,`num`) values (1,'20151208',88),(2,'20151210',0);


CREATE TABLE `question` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(10) unsigned NOT NULL COMMENT 'uid=0是后台添加的提问',
  `uname` varchar(55) NOT NULL DEFAULT '' COMMENT '账号密码登陆 手机号为空',
  `mobile` char(11) NOT NULL DEFAULT '' COMMENT '手机号登陆 账号为空',
  `tit` varchar(100) NOT NULL,
  `cont` varchar(255) NOT NULL DEFAULT '',
  `tag` varchar(255) NOT NULL DEFAULT '' COMMENT '问题所属的类别 多个',
  `recreply` int(10) NOT NULL DEFAULT '0' COMMENT '预留字段,推荐回复,对应reply表id,显示在/ask/页面',
  `view` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '查看次数',
  `solved` tinyint(1) NOT NULL DEFAULT '0' COMMENT '0:未解决,1:已解决',
  `replynum` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '问题回复数',
  `status` tinyint(3) NOT NULL DEFAULT '0' COMMENT '1:显示,0:待审核,-1:不显示',
  `alias` varchar(200) NOT NULL DEFAULT '' COMMENT 'url alias',
  `keywords` varchar(200) NOT NULL DEFAULT '' COMMENT 'seo keywords',
  `description` varchar(400) NOT NULL DEFAULT '' COMMENT 'seo description',
  `addtime` int(10) NOT NULL,
  `uptime` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `solved` (`solved`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8 CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC COMMENT='问题表';


insert  into `question`(`id`,`uid`,`uname`,`mobile`,`tit`,`cont`,`tag`,`recreply`,`view`,`solved`,`replynum`,`status`,`alias`,`keywords`,`description`,`addtime`,`uptime`) values (1,0,'','','经常性感冒是什么原因？','','健康咨询',0,0,1,5,1,'ask/1.html','','',1449565582,1449565604),(2,0,'','','最近总失眠怎么办？','','健康咨询',0,2,1,5,1,'ask/2.html','','',1449565846,0),(3,0,'','','办公室一族怎样预防肩周炎的发生？','','健康咨询',0,1,1,3,1,'ask/3.html','','',1449565909,0),(4,0,'','','颈椎病的症状有哪些？','','健康咨询',0,0,1,5,1,'ask/4.html','','',1449565972,0),(5,0,'','','有哪些方法可以防治口腔溃疡？','','健康咨询',0,0,1,3,1,'ask/5.html','','',1449566044,0),(6,0,'','','吃什么可以防治便秘？','','健康咨询',0,0,1,3,1,'ask/6.html','','',1449566070,0),(7,0,'','','早上起床突然感到心悸是怎么回事？','','健康咨询',0,0,1,3,1,'ask/7.html','','',1449566395,0),(8,0,'','','最近头晕得厉害，如何食疗？','','健康咨询',0,0,1,3,1,'ask/8.html','','',1449566424,0),(9,0,'','','近期扁桃体发炎，忌吃什么？','','健康咨询',0,0,1,3,1,'ask/9.html','','',1449566449,0),(10,0,'','','小孩子抵抗力差，有什么方法可以增强抵抗力？','','健康咨询',0,0,1,4,1,'ask/10.html','','',1449566474,0),(11,0,'','','宝宝得了肺炎，吃什么好得快？','','健康咨询',0,0,1,3,1,'ask/11.html','','',1449566501,0),(12,0,'','','宝宝最近老拉肚子，吃什么比较好？','','健康咨询',0,0,1,3,1,'ask/12.html','','',1449566524,0),(13,0,'','','宝宝发烧39度，怎么办？','','健康咨询',0,0,1,3,1,'ask/13.html','','',1449566545,0),(14,0,'','','发现牙龈有些萎缩，影响美观，怎么办才好？','','健康咨询',0,0,1,3,1,'ask/14.html','','',1449566568,0),(15,0,'','','最近刷牙会出血，怎样防止得牙周炎？','','健康咨询',0,0,1,3,1,'ask/15.html','','',1449566589,0),(16,0,'','','牙龈肿痛是怎么引起的？','','健康咨询',0,0,1,3,1,'ask/16.html','','',1449566609,0),(17,0,'','','我才26岁，这几天突然腰痛的直不起来，咋回事？','','健康咨询',0,0,1,3,1,'ask/17.html','','',1449566635,0),(18,0,'','','小腿抽筋怎么治？','','健康咨询',0,0,1,3,1,'ask/18.html','','',1449566655,0),(19,0,'','','爷爷有糖尿病，在平时的饮食上应注意什么？','','健康咨询',0,0,1,3,1,'ask/19.html','','',1449566676,0),(20,0,'','','高血压患者在饮食习上要注意什么？','','健康咨询',0,3,1,4,1,'ask/20.html','','',1449566698,1449712653);


CREATE TABLE `question_tag` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `qid` int(10) unsigned NOT NULL COMMENT '对应问题表id',
  `typeid` int(6) unsigned NOT NULL COMMENT '对应product的小类stype',
  PRIMARY KEY (`id`),
  KEY `qid` (`qid`),
  KEY `typeid` (`typeid`)
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8 CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC COMMENT='问题与类别对应表多对多';


insert  into `question_tag`(`id`,`qid`,`typeid`) values (1,1,23),(2,2,23),(3,3,23),(4,4,23),(5,5,23),(6,6,23),(7,7,23),(8,8,23),(9,9,23),(10,10,23),(11,11,23),(12,12,23),(13,13,23),(14,14,23),(15,15,23),(16,16,23),(17,17,23),(18,18,23),(19,19,23),(23,20,23);


CREATE TABLE `reply` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `qid` int(10) NOT NULL COMMENT '对应question表id',
  `uname` varchar(100) NOT NULL,
  `cont` text NOT NULL,
  `addtime` int(10) NOT NULL,
  `uptime` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `qid` (`qid`)
) ENGINE=InnoDB AUTO_INCREMENT=94 DEFAULT CHARSET=utf8 CHECKSUM=1 DELAY_KEY_WRITE=1 ROW_FORMAT=DYNAMIC COMMENT='回复表';


insert  into `reply`(`id`,`qid`,`uname`,`cont`,`addtime`,`uptime`) values (26,1,'system','风寒感冒：与病人感受风寒有关。起因通常是劳累，没休息好，再加上吹风或受凉。 \r\n风寒感冒通常秋冬发生比较多。',1449565746,0),(27,1,'system','风热感冒：起因通常是便秘，很多时属于阳明经症。',1449565764,0),(28,1,'system','暑湿感冒：感受暑湿时邪，又因喜欢纳凉和饮冷，使体内的暑湿为风寒所遏，疏泄受阻，因而发病。',1449565788,0),(29,1,'system','暑热感冒：因久旱酷热而生，属于纯粹的阳热证候。',1449565799,0),(30,1,'system','时行感冒：多与气候突变、寒温失常有关。',1449565807,0),(31,2,'system','饮食宜清淡、少食辛辣、煎炒、油炸、烈酒等不消化和刺激性食物。',1449565851,0),(32,2,'system','避免过于劳累，缓解自己的压力，保持愉快的心情。',1449565859,0),(33,2,'system','睡前不要吃太饱。',1449565866,0),(34,2,'system','保持宁静祥和的心惊，尽量避免过度兴奋或悲伤。',1449565872,0),(35,2,'system','养成良好的休息习惯。',1449565877,0),(36,3,'system','加强体育锻炼。',1449565916,0),(37,3,'system','应重视保暖防寒，勿使肩部受凉。',1449565923,0),(38,3,'system','加强肩关节肌肉的锻炼可以预防和延缓肩周炎的发生和发展。',1449565928,0),(39,4,'system','脖子扭痛。',1449566013,0),(40,4,'system','颈部疼痛。',1449566018,0),(41,4,'system','手脚发麻。',1449566023,0),(42,4,'system','面部闪电疼痛。',1449566027,0),(43,4,'system','颈椎生理曲度变直。',1449566032,0),(44,5,'system','注意进食维生素含量丰富的食物，比如深色蔬菜水果、胡萝卜、青菜、苹果等，避免进食辛辣刺激食物。',1449566052,0),(45,5,'system','注意保持口腔清洁，勤漱口。',1449566057,0),(46,5,'system','在平时的饮食中注意多吃些动物肝脏、鸡蛋、牛奶、豆类等食物。',1449566062,0),(47,6,'system','乳酸菌调整肠内平衡，乳酸菌是益生菌的一种，具有调整肠内平衡的作用。平时多食用酸奶、纳豆、味噌、腌制物等发酵食品可有效防治便秘。',1449566076,0),(48,6,'system','酵素助消化，蔬菜、水果等富含酵素，多食用也能防治便秘。',1449566086,0),(49,6,'system','可多食用大豆、海藻等富含食物纤维类的食物。',1449566091,0),(50,7,'system','晚上睡觉的睡姿不正确加上起床太急可能会造成心悸。',1449566399,0),(51,7,'system','气温和气压太高或太低都会影响心脑、呼吸等系统的正常运作，应根据天气状况和气温增减着身衣物。',1449566405,0),(52,7,'system','注意休息，切忌过度劳累。',1449566411,0),(53,8,'system','鸡蛋红糖治头晕。豆油适量放锅内烧热，将2个鸡蛋、30克红糖（放一点水搅拌）倒入锅内煎熟，空腹服用，连服10天。为巩固疗效，也可多服几天。',1449566428,0),(54,8,'system','鸭蛋赤豆治头晕。鸭蛋一个、赤豆20粒，搅匀蒸熟，早晨空腹服，每日一次，连用7天有特效。',1449566433,0),(55,8,'system','菊花治头晕。菊花功能降血压、明目解毒、治头晕、头痛、耳鸣目眩，能使小便清长。高血压的人可用菊花枕头，对妇女肝阳火盛引致头晕、晚间烦躁不能成眠者有帮助。可将野菊花加入油柑子叶、绿豆壳或通草丝，晒干待冷装入枕袋内再缝密即可。',1449566440,0),(56,9,'system','咽喉肿痛为实热邪火，是热症。忌吃温热温补的食物，如：狗肉、羊肉、鸡肉、鹅肉、鹧鸪肉等，温热性食物吃了易助热动火，生热助痰，很容易加剧咽喉肿痛。',1449566457,0),(57,9,'system','忌吃橘子。性凉，味甘酸。如过多食用，极易出现咽喉干痛，口舌生疮或溃疡。所以，在患有咽喉肿痛期间，暂不宜多吃橘子。',1449566462,0),(58,9,'system','饮食宜清淡为主，暂时还应忌吃生姜、葱、蒜、洋葱、香椿头、芥菜、花椒、荔枝、樱桃、大枣、猪肥肉、虾、海参、黄芪、冬虫夏草、香烟、白酒、酒酿等。',1449566467,0),(59,10,'system','让小孩多晒太阳，充分利用自然界的日光、空气和水等进行锻炼。',1449566479,0),(60,10,'system','保证幼儿良好的睡眠，不要过度劳累。',1449566484,0),(61,10,'system','注意营养全面均衡，不要暴饮暴食，防止上火。',1449566490,0),(62,10,'system','流行季节要少外出，避免接触感冒病人。',1449566495,0),(63,11,'system','鱼腥草芦根汤，可清热化痰，对治疗小儿肺炎有显著效果。食谱原料：鱼腥草30克，芦根30克，红枣12克。做法：取以上材料加水煮30分钟饮用即可。',1449566507,0),(64,11,'system','鸭肫山药粥，有健脾收敛作用，主治小儿肺炎支原体肺炎等疾病。食谱原料：鸭肫1个，山药15克，芡实15克，粳米50克。做法是：1、先将鸭肫洗净，切碎；2、再将山药、芡实，粳米加水煮粥食用。',1449566511,0),(65,11,'system','竹沥粥，清热化痰，理气止咳。适用于肺炎咳嗽，痰黄粘稠，不易咯出，胸痛气促等，主治小儿肺炎支原体肺炎等疾病。食谱原料：鲜竹沥口服液2支，大米100g，蜂蜜20g。做法：将大米煮为稀粥，待熟时调入鲜竹沥、蜂蜜，再煮一、二沸即成。每日1剂，连续3-5剂。',1449566515,0),(66,12,'system','焦米汤：先把米粉或奶糕研成粉，炒到颜色发黄，再加适量的水和糖，然后烧成糊状就可以了。米粉加水以后再加热，它的炭化结构有较好的吸附止泻作用。',1449566528,0),(67,12,'system','软面条。当宝宝拉肚子情况出现好转时，可以给宝宝煮些烂乎的面条，适当加一些青菜。这样能进一步给宝宝补充营养，宝宝吃了也比较好消化。',1449566533,0),(68,12,'system','蛋黄膳：将鸡蛋煮熟后去壳和蛋白，用蛋黄放在锅内小火熬炼取油，1岁内婴儿每天一个蛋黄油，分2—3次服，3天为一个疗程，治疗腹泻，并有补脾益胃止泻作用。',1449566538,0),(69,13,'system','发烧39℃以上为高热，小儿高热易致惊厥，需应用解热镇痛剂，降低体温，缓解高热带来的并发症，但不能根除病因。如高热不退，应及时到医院诊治。',1449566551,0),(70,13,'system','应绝对卧床，敞开包被或松解衣服，使皮肤裸露，头部放置冰袋或冷湿毛巾，尽快到医院诊治。',1449566557,0),(71,13,'system','半岁以内婴儿发高烧时一般不打退烧针，不服退烧药，最佳降温方法是温水擦浴，即洗个温水澡。紧急处理后无论是否退热，都应带孩子上医院就诊。',1449566561,0),(72,14,'system','应养成良好的口腔卫生习惯，防止异物入口，每天应该做好牙齿的清洁工作，及时刷牙，保证每天早晚各一次，午餐后及时漱口，这样可以去除异物，保证牙齿健康。',1449566573,0),(73,14,'system','有些口腔问题也是会引起牙龈萎缩，如牙结石、牙周炎、口腔溃疡或是牙龈脓肿，甚至有的假牙也会造成牙龈萎缩，建议及时治疗。',1449566579,0),(74,14,'system','可以通过食疗的办法来缓解牙龈萎缩的问题，可以自己制作瘦肉枸杞汤或煮鸡蛋，加入生地、熟地、生姜等一起煮。每天服用，对治疗口腔疾病有帮助，能有效防治牙龈萎缩。',1449566584,0),(75,15,'system','正确刷牙。刷牙时有目的地将牙刷毛向上或向下倾斜45度，压在牙龈上，反复按摩。或者将牙刷放在牙根部，反复上下短距离地颤动，对牙龈边缘和龈乳头有按摩和清洁局部的作用。',1449566594,0),(76,15,'system','口外按摩。漱口后，用右手食指放在牙龈相应的面部皮肤上，按一定的顺序轻轻上下按摩，也可做小圆形的旋转按摩，有利于改善局部的血液循环。',1449566599,0),(77,15,'system','咀嚼粗糙、富含纤维素的食物，会对牙龈组织产生适当的刺激，起到良好的按摩作用。',1449566604,0),(78,16,'system','很多是由于上呼吸道感染（感冒或上火）引起的急性牙龈炎，通常伴有有喉痛、舌苔黄而厚、口发干发苦的症状。',1449566614,0),(79,16,'system','若你本身有蛀牙，由于蛀牙引起的急性牙髓炎并发急性牙龈炎，也会导致牙龈肿痛。',1449566621,0),(80,16,'system','建议饮食上注意不要吃太多容易引起上火的食物，如膨化食品、油炸辛辣食物。',1449566626,0),(81,17,'system','一般考虑腰肌劳损或椎间盘突出，建议卧床休息，服用双氯芬酸钠缓释片，氯唑沙宗等药物治疗，必要时做腰椎CT检查。',1449566639,0),(82,17,'system','也有可能是腰扭伤引起的关节紊乱卡压导致的',1449566644,0),(83,17,'system','腰部疼痛直不起腰来，往往是肌肉或韧带拉伤，若有受暴力史，应去医院做个腰椎ct检查，警惕骨折或椎间盘突出之类的疾病。若检查无大碍，可以局部热敷按摩，同时服用抗生素和舒筋活血的药物治疗，慢慢就会好的。',1449566649,0),(84,18,'system','驱寒保暖。',1449566660,0),(85,18,'system','必要时补充一些维生素E。',1449566664,0),(86,18,'system','多参加体育锻炼。',1449566671,0),(87,19,'system','控制糖类的摄入；是糖尿病人的饮食治疗的关键。另外如食糖、糖果、糕点、甜食、果酱、白薯、水果、土豆等外，主食的量也应严格控制。',1449566683,0),(88,19,'system','应补充适量奶、蛋、鱼、瘦肉、豆制品等含蛋白质丰富的食物。一般病人每日每公斤体重约需蛋白质l～1．5克。',1449566687,0),(89,19,'system','糖尿病人脂肪的供应量，应根据具体情况而定。一般病人每日总量应为50至60克；消瘦病人可相应提高脂肪量，但最多不能超过糖的一倍；肥胖病人应严格限制脂肪量，每日不宜超过40克。为预防动脉硬化，最好选用植物油，忌用胆固醇高的动物脂肪。',1449566692,0),(90,20,'system','要控制能量的摄入。提倡吃复合糖类、如淀粉、玉米、少吃葡萄糖、果糖及蔗糖，这类糖属于单糖，易引起血脂升高。',1449566702,0),(91,20,'system','限制脂肪的摄入。尽量食用植物油，可多吃海鱼，海鱼含有不饱和脂肪酸，能使胆固醇氧化，从而降低血浆胆固醇，还可延长血小板的凝聚，抑制血栓形成，防止中风。',1449566708,0),(92,20,'system','适量摄入蛋白质。高血压患者每日蛋白质的量为每公斤体重1g比较合适。每周吃2-3次鱼类蛋白质，可改善血管弹性和通透性，增加尿钠排出，从而降低血压。如高血压合并肾功能不全时，应限制蛋白质的摄入。',1449566712,0),(93,20,'system','多汔新鲜蔬菜，水果。每天最低吃8两新鲜蔬菜，水果2-4两。',1449566717,0);

